app/controllers/core_patient_registration_controller.rb

  def create

    print = true
    if params[:identifier] && (params[:identifier].match(/P\d{12}/) || params[:identifier].length == 6)

      print = false if params[:identifier].length == 13

      params[:person][:identifiers] = {"National id" => params[:identifier]}

      person = CorePerson.create_from_form(params[:person])

    elsif params[:identifier].present?

      raise ("Unsupported identifier format").to_s

    else

      person = CorePerson.create_patient_from_dde(params) if create_from_dde_server
---
INSERT INTO `person` (`voided`, `voided_by`, `date_created`, `birthdate_estimated`, `changed_by`, `uuid`, `gender`, `birthdate`, `death_date`, `date_changed`, `void_reason`, `dead`, `creator`, `cause_of_death`, `date_voided`) VALUES(0, NULL, '2012-12-12 13:40:06', 0, 1, '703cf775-4461-11e2-9220-30f9edafb6df', 'M', NULL, NULL, '2012-12-12 13:40:05', NULL, 0, 1, NULL, NULL)
INSERT INTO `patient` (`tribe`, `void_reason`, `date_voided`, `patient_id`, `voided`, `voided_by`, `date_changed`, `creator`, `changed_by`, `date_created`) VALUES(NULL, NULL, NULL, 116, 0, NULL, '2013-01-23 10:41:30', 1, 1, '2013-01-23 10:41:30')

  def national_id_label

    @person = CorePerson.find(params[:patient_id])
---
SELECT * FROM `person` WHERE (`person`.`person_id` = 29) AND (person.voided = 0)

  def select

    if !params[:person].nil?
      if (params[:identifier]) || (!params[:person][:id].blank? && params[:person][:id].to_i != 0) || params["person"]["patient"]["identifiers"]["National id"]
---
SELECT * FROM `person` WHERE (`person`.`person_id` = 115) AND (person.voided = 0)

  def district
    region_id = CoreRegion.find_by_name("#{params[:filter_value]}").id rescue nil
    region_conditions = ["name LIKE (?) AND region_id = ? ", "#{params[:search_string]}%", region_id]

    districts = CoreDistrict.find(:all,:conditions => region_conditions, :order => 'name') rescue []
---
SELECT * FROM `region` WHERE (`region`.`name` = 'Central Region') LIMIT 1
SELECT * FROM `district` WHERE (name LIKE ('%') AND region_id = 1 ) ORDER BY name

  def traditional_authority
    district_id = CoreDistrict.find_by_name("#{params[:filter_value]}").id
    traditional_authority_conditions = ["name LIKE (?) AND district_id = ?", "%#{params[:search_string]}%", district_id]

    traditional_authorities = CoreTraditionalAuthority.find(:all,:conditions => traditional_authority_conditions, :order => 'name')
---
SELECT * FROM `district` WHERE (`district`.`name` = 'Lilongwe') LIMIT 1
SELECT * FROM `traditional_authority` WHERE (name LIKE ('%%') AND district_id = 18) ORDER BY name

  def village
    traditional_authority_id = CoreTraditionalAuthority.find_by_name("#{params[:filter_value]}").id
    village_conditions = ["name LIKE (?) AND traditional_authority_id = ?", "%#{params[:search_string]}%", traditional_authority_id]

    villages = CoreVillage.find(:all,:conditions => village_conditions, :order => 'name')
---
SELECT * FROM `traditional_authority` WHERE (`traditional_authority`.`name` = 'Chiseka') LIMIT 1
SELECT * FROM `village` WHERE (name LIKE ('%%') AND traditional_authority_id = 115) ORDER BY name


    results = CorePerson.search_by_identifier(identifier) rescue []

    if results.length > 1 || results.to_s == "found duplicate identifiers"
---
SELECT * FROM `person` WHERE (`person`.`person_id` = 44) AND (person.voided = 0)


        if File.exists?(app_name_file)

          @app_name = YAML.load_file(app_name_file)["#{Rails.env
        }"]["remote.app.name.#{params[:user_id]}"].strip rescue "" || params[:app_name]

        end

        DDEService.create_footprint(dde_patient.patient.national_id, @app_name) rescue nil if
        ((!@app_name.blank? && !dde_patient.patient.national_id.blank?) rescue false)

      else

      end

      if File.exists?(file)

        @destination = YAML.load_file(file)["#{Rails.env}"]["host.path.#{params[:user_id]}"].strip

        File.delete(file)

      end

      host = request.raw_host_with_port.gsub("localhost", "0.0.0.0").gsub("127.0.0.1", "0.0.0.0")
---
INSERT INTO `patient` (`tribe`, `voided`, `patient_id`, `date_voided`, `creator`, `date_changed`, `void_reason`, `date_created`, `changed_by`, `voided_by`) VALUES(NULL, 0, 61, NULL, 1, '2012-12-13 09:32:45', NULL, '2012-12-13 09:32:45', 1, NULL)

  def change_national_id
    patient = CorePerson.find(params[:patient_id])
---
SELECT * FROM `person` WHERE (`person`.`person_id` = 48) AND (person.voided = 0)

  def demographics

    @patient = CorePerson.find(params[:id] || params[:patient_id]) rescue nil
---
SELECT * FROM `person` WHERE (`person`.`person_id` = 44) AND (person.voided = 0)

  def edit_demographics
    @patient = CorePerson.find(params[:id] || params[:patient_id]) rescue nil
---
SELECT * FROM `person` WHERE (`person`.`person_id` = 44) AND (person.voided = 0)

  def update_demographics

    params["person"]["gender"] = params["person"]["gender"][0 .. 0] if params["person"]["gender"]

    patient = CorePerson.find(params[:id] || params[:patient_id])
    CorePerson.update_demographics(params, params[:user_id])
---
SELECT * FROM `person` WHERE (`person`.`person_id` = 44) AND (person.voided = 0)
UPDATE `person` SET `birthdate_estimated` = 0, `birthdate` = '1982-09-01', `date_changed` = '2012-12-14 09:08:27' WHERE `person_id` = 78

  def create_baby

    person = CorePerson.create_patient_from_dde(params) if create_from_dde_server

    if person.blank?

      person = CorePerson.create_from_form(params[:person])

    end

    CoreRelationship.create(
      :person_b => person.id,
      :relationship => (CoreRelationshipType.find_by_a_is_to_b_and_b_is_to_a("Parent", "Child").id),
      :person_a => params[:mother_id]
    )
---
INSERT INTO `patient` (`void_reason`, `creator`, `changed_by`, `tribe`, `voided_by`, `date_voided`, `date_changed`, `voided`, `patient_id`, `date_created`) VALUES(NULL, 1, 1, NULL, NULL, NULL, '2013-01-10 08:09:36', 0, 113, '2013-01-10 08:09:36')
INSERT INTO `person` (`void_reason`, `voided`, `birthdate`, `date_voided`, `birthdate_estimated`, `death_date`, `date_created`, `voided_by`, `uuid`, `dead`, `date_changed`, `cause_of_death`, `changed_by`, `creator`, `gender`) VALUES(NULL, 0, NULL, NULL, 0, NULL, '2013-01-09 11:07:35', NULL, 'c5821dca-5a4c-11e2-8781-30f9edafb6df', 0, '2013-01-09 11:07:35', NULL, 1, 1, 'M')
INSERT INTO `relationship` (`void_reason`, `relationship`, `creator`, `uuid`, `voided_by`, `date_voided`, `voided`, `person_a`, `person_b`, `date_created`) VALUES(NULL, 11, 1, '12e31fe8-5afd-11e2-b384-30f9edafb6df', NULL, NULL, 0, 113, 78, '2013-01-10 08:09:36')
SELECT * FROM `relationship_type` WHERE (`relationship_type`.`a_is_to_b` = 'Child' AND `relationship_type`.`b_is_to_a` = 'Parent') ORDER BY weight DESC LIMIT 1